src/cf/Documents/GDS_ЗаправочнаяВедомость.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>GDS_ЗаправочнаяВедомость</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.GDS_ДанныеЗаправочнойВедомостиИЗаправок</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АЗС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатАЗС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГСМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоВсего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Локация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатМаршруты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МОЛ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВедомости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.GDS_ТипыЗаправочныхВедомостей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Заправки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПЛ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.уатПутевойЛист</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заправка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.уатЗаправкаГСМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаЗаправки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПЛ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПЛ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Плотность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоИзАвтограф</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЗаправленоИзАвтограф</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Enums/GDS_ТипыЗаправочныхВедомостей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>GDS_ТипыЗаправочныхВедомостей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приходная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Заправочная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переливная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Инвентаризационная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/уатВидыДвиженияГСМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатВидыДвиженияГСМ</Name>
			<Comment>(уат)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВводОстатков</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаправкаНаличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаправкаПластиковаяКарта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаправкаПластиковаяКартаСклад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаправкаПоставщик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаправкаСклад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаправкаТалоны</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Слив</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеПЛ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/GDS_ЗаправочнаяВедомость/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.ТипВедомости) Тогда
		Объект.ТипВедомости = Перечисления.GDS_ТипыЗаправочныхВедомостей.Заправочная;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьДанныеКолонкиКг();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ОбновитьДанныеКолонкиКг();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	СпрПривлеченный = Справочники.уатТС.НайтиПоНаименованию("Привлеченный транспорт",Истина);
	СпрВерхнееОбору = Справочники.уатТС.НайтиПоНаименованию("Верхнее  Оборудование",Истина);
	Для Каждого Строка из Объект.Заправки Цикл
		Если НЕ Строка.ПЛ.Пустая() Тогда
			Если НачалоМесяца(Строка.ПЛ.Дата)<>НачалоМесяца(Объект.Дата) Тогда
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "В строке " + Строка.НомерСтроки + " ошибка. Путевой лист другого периода.";
				Сообщение.Сообщить();
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
		Если Строка.ТС.ПринадлежитЭлементу(СпрПривлеченный) Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "В строке " + Строка.НомерСтроки + " ошибка. ТС - привлеченный транспорт.";
			Сообщение.Сообщить();
		ИначеЕсли Строка.ТС.ПринадлежитЭлементу(СпрВерхнееОбору) Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "В строке " + Строка.НомерСтроки + " ошибка. ТС - верхнее оборудование.";
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;	
		Если Строка.ТС.ПометкаУдаления Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "В строке " + Строка.НомерСтроки + " ошибка. ТС помечено на удаление.";
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;	
		Если Строка.ПЛ.ПометкаУдаления Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "В строке " + Строка.НомерСтроки + " ошибка. Документ Путевой лист помечен на удаление.";
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;	
		
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ОбновитьДанныеКолонкиКг();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура АЗСПриИзменении(Элемент)
	АЗСПриИзмененииНаСервере(); 
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Заправки

&НаКлиенте
Процедура ЗаправкиКоличествоПриИзменении(Элемент)
	ТекДанные = Элементы.Заправки.ТекущиеДанные;
	ТекДанные.Кг = ТекДанные.Количество * ТекДанные.Плотность; 
	ОбновитьДанныеКолонкиКг();
КонецПроцедуры

&НаКлиенте
Процедура ЗаправкиПлотностьПриИзменении(Элемент)
	ТекДанные = Элементы.Заправки.ТекущиеДанные;
	ТекДанные.Кг = ТекДанные.Количество * ТекДанные.Плотность;  
	ОбновитьДанныеКолонкиКг();	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПерезаполнитьКоличествоПоПЛ(Команда)
	
	Для каждого ТекСтрока из Объект.Заправки Цикл
		
		ДокументПЛ = ЗаправкиПриИзмененииНаСервере(ТекСтрока.НомерПЛ,ТекСтрока.ДатаЗаправки);
		
		Если ДокументПЛ.Пустая() Тогда
			Возврат;
		КонецЕсли;
		
		ТекСтрока.НомерПЛ = ПолучитьНомер(ДокументПЛ);
		ТекСтрока.ТС = ПолучитьТС(ДокументПЛ);
		
		Если уатОбщегоНазначения.уатЗначениеНеЗаполнено(ТекСтрока.ПЛ) ИЛИ ТекСтрока.ТС <> ПолучитьТС(ДокументПЛ) Тогда
			мДатаНачала = ДобавитьМесяц(Объект.Дата, -1);
			
			Док = уатПутевыеЛисты(ПолучитьТС(ДокументПЛ), мДатаНачала, КонецДня(ТекСтрока.ДатаЗаправки),ПолучитьНомер(ДокументПЛ), );
			
			Если НЕ Док.Пустая() Тогда
				//ТекСтрокаЗаправки.НомерПЛ  = мПутевойЛист.Номер;
				ТекСтрока.ПЛ = Док;
			Иначе
				
			КонецЕсли;	
		КонецЕсли;
		
		
		ТекСтрока.ПЛ = ДокументПЛ;
		
		КолВоЛПоПутевому = ПолучитьКолВоПоПутевому(ДокументПЛ,ТекСтрока.ДатаЗаправки);
		
		ТекСтрока.КоличествоПЛ = КолВоЛПоПутевому; 
		
		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаправкиВПутевыхЛистах(Команда)
	СоздатьЗаправкиВПутевыхЛистахНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоПутевымЛистам(Команда)
	
	Если Объект.Заправки.Количество() > 0 Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Ответ = Вопрос("Табличная часть не пуста. Очистить?", Режим, 0, КодВозвратаДиалога.Нет);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Объект.Заправки.Очистить();
	
	ЗаполнитьПоПутевымЛистамНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеИзАвтограф(Команда)
	ЗаполнитьДанныеИзАвтографНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПоПутевымЛистамНаСервере()
	
	//+ Boris
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	уатЗаправкаГСМЗаправки.ТС КАК ТС,
	|	уатЗаправкаГСМЗаправки.ПутевойЛист КАК ПЛ,
	|	уатЗаправкаГСМЗаправки.Количество КАК Количество,
	|	уатЗаправкаГСМЗаправки.Ссылка КАК Заправка,
	|	уатЗаправкаГСМЗаправки.Дата КАК ДатаЗаправки,
	|	уатЗаправкаГСМЗаправки.Проценты КАК Плотность
	|ИЗ
	|	Документ.уатЗаправкаГСМ.Заправки КАК уатЗаправкаГСМЗаправки
	|ГДЕ
	|	уатЗаправкаГСМЗаправки.Ссылка.Проведен
	|	И уатЗаправкаГСМЗаправки.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	И уатЗаправкаГСМЗаправки.Ссылка.АЗС = &АЗС
	|	И уатЗаправкаГСМЗаправки.ГСМ = &ГСМ
	|	И уатЗаправкаГСМЗаправки.Ссылка.ВидДвиженияГСМ = &ВидДвиженияГСМ
	|
	|СГРУППИРОВАТЬ ПО
	|	уатЗаправкаГСМЗаправки.ТС,
	|	уатЗаправкаГСМЗаправки.ПутевойЛист,
	|	уатЗаправкаГСМЗаправки.Количество,
	|	уатЗаправкаГСМЗаправки.Ссылка,
	|	уатЗаправкаГСМЗаправки.Дата,
	|	уатЗаправкаГСМЗаправки.Проценты";
	
	Запрос.УстановитьПараметр("АЗС", Объект.АЗС);
	Запрос.УстановитьПараметр("ВидДвиженияГСМ", Перечисления.уатВидыДвиженияГСМ.ЗаправкаСклад);
	Запрос.УстановитьПараметр("ГСМ", Объект.ГСМ);
	Запрос.УстановитьПараметр("ДатаКон",  КонецМесяца(Объект.Дата));
	Запрос.УстановитьПараметр("ДатаНач", НачалоМесяца(Объект.Дата));
	
	Объект.Заправки.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Для Каждого Элм Из Объект.Заправки Цикл
		КолВоЛПоПутевому = ПолучитьКолВоПоПутевому(Элм.ПЛ, Элм.ДатаЗаправки);
		Элм.КоличествоПЛ = КолВоЛПоПутевому;
		Элм.Кг = Элм.Количество * Элм.Плотность;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция уатДополнитьСтроку(Знач Стр, Длина, Чем=" ", Режим = 0) 
	
	СимволовДополнить = Длина -  СтрДлина(Стр);
	Добавок = "";
	Для Н=1 по СимволовДополнить Цикл
		Добавок =	Добавок + Чем;
	КонецЦикла;
	Возврат ?(Режим=0, Добавок + Стр, Стр + Добавок);
	
КонецФункции 

&НаСервере
Функция ЗаправкиПриИзмененииНаСервере(НомерПЛ,ДатаПЛ)
	
	НомерДляПоиска = ?(СтрДлина(НомерПЛ)< 11,уатДополнитьСтроку(НомерПЛ, 11, "0"),НомерПЛ);
	
	Если Документы.уатПутевойЛист.НайтиПоНомеру(НомерДляПоиска,ДатаПЛ).Пустая() Тогда
		Возврат Документы.уатПутевойЛист.ПустаяСсылка();
	Иначе	
		ДокументПЛ = Документы.уатПутевойЛист.НайтиПоНомеру(НомерДляПоиска,ДатаПЛ).Ссылка;
		Возврат ДокументПЛ;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ЗаправкиПриИзмененииНаСервере1(ТС,ДатаПЛ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	уатПутевойЛист.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.уатПутевойЛист КАК уатПутевойЛист
	|ГДЕ
	|	уатПутевойЛист.Дата МЕЖДУ &Нач И &Кон
	|	И уатПутевойЛист.ТранспортноеСредство = &ТС";
	
	Запрос.УстановитьПараметр("ТС", ТС);
	Запрос.УстановитьПараметр("Кон", КонецДня(ДатаПЛ));
	Запрос.УстановитьПараметр("Нач", НачалоДня(ДатаПЛ));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Документы.уатПутевойЛист.ПустаяСсылка();
	
КонецФункции

&НаСервере
Функция ПолучитьНомер(ДокументПЛ)
	Возврат ДокументПЛ.Номер;
КонецФункции

&НаСервере
Функция ПолучитьТС(ДокументПЛ)
	Возврат ДокументПЛ.ТранспортноеСредство;
КонецФункции

&НаСервере
Функция уатПутевыеЛисты(ТС, ДатаНач, ДатаКон, НомерПЛ = Неопределено, Рассчитан = Неопределено) 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНач", ДатаНач);
	Запрос.УстановитьПараметр("ДатаКон", ДатаКон);
	Запрос.УстановитьПараметр("ТС", ТС);
	Запрос.УстановитьПараметр("ПометкаУдаления", Истина);
	Запрос.УстановитьПараметр("НомерПЛ", НомерПЛ);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	уатПутевойЛист.Ссылка
	|ИЗ
	|	Документ.уатПутевойЛист КАК уатПутевойЛист
	|ГДЕ
	|	(НЕ уатПутевойЛист.ПометкаУдаления)
	|	И (уатПутевойЛист.ДатаВозвращения МЕЖДУ &ДатаНач И &ДатаКон
	|			ИЛИ уатПутевойЛист.ДатаВыезда МЕЖДУ &ДатаНач И &ДатаКон)";
	
	Если НомерПЛ <> Неопределено Тогда
		Запрос.Текст = СокрЛП(Запрос.Текст)	+ " И
		|	уатПутевойЛист.Номер = &НомерПЛ";
	КонецЕсли;
	
	Если Рассчитан <> Неопределено Тогда
		Запрос.Текст = СокрЛП(Запрос.Текст)	+ " И
		|	уатПутевойЛист.Рассчитан = &Рассчитан";
		Запрос.УстановитьПараметр("Рассчитан", Рассчитан);
	КонецЕсли;
	
	Если Метаданные.Документы.уатПутевойЛист.ТабличныеЧасти.Задание.Реквизиты.Найти("Прицеп1") <> Неопределено Тогда //ПРОФ
		Запрос.Текст = Запрос.Текст + "
		|	И (уатПутевойЛист.ТранспортноеСредство = &ТС
		|	ИЛИ уатПутевойЛист.Прицепы.ТС.Модель.НаличиеТопливногоБака И уатПутевойЛист.Прицепы.ТС = &ТС
		|	ИЛИ уатПутевойЛист.Задание.Прицеп1.Модель.НаличиеТопливногоБака И уатПутевойЛист.Задание.Прицеп1 = &ТС
		|	ИЛИ уатПутевойЛист.Задание.Прицеп2.Модель.НаличиеТопливногоБака И уатПутевойЛист.Задание.Прицеп2 = &ТС)";
	Иначе //СТАНДАРТ
		Запрос.Текст = Запрос.Текст + "
		|	И (уатПутевойЛист.ТранспортноеСредство = &ТС
		|	ИЛИ уатПутевойЛист.Прицепы.ТС.Модель.НаличиеТопливногоБака И уатПутевойЛист.Прицепы.ТС = &ТС)";
	КонецЕсли;
	
	Запрос.Текст = СокрЛП(Запрос.Текст)	+ "
	|УПОРЯДОЧИТЬ ПО
	|	уатПутевойЛист.ДатаВыезда";
	
	РезультатТаблица = Запрос.Выполнить().Выгрузить();
	Если РезультатТаблица.Количество()>0 Тогда
		Возврат РезультатТаблица[0].Ссылка;
	КонецЕсли;
	Возврат Документы.уатПутевойЛист.ПустаяСсылка();
КонецФункции // глСпидометр       

&НаСервере
Функция ПолучитьКолВоПоПутевому(ДокументПЛ, ДатаЗаправки)
	тблЗаправки = уатОбщегоНазначения.уатПолучитьЗаправкиДляПЛ(ДокументПЛ.Ссылка);
	Количество = 0;
	Для каждого строка из тблЗаправки Цикл
		Если НачалоДня(строка.ДатаЗаправки) = НачалоДня(ДатаЗаправки) Тогда
			Если Объект.АЗС = строка.АЗС Тогда
				Количество = Количество + Строка.Количество;
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;	
	
	Возврат Количество;
КонецФункции	

&НаКлиенте
Процедура ЗаправкиПриИзменении(Элемент)
	Если Элемент.ТекущиеДанные.ПЛ.Пустая() Тогда
		Если СокрЛП(Элемент.ТекущиеДанные.НомерПЛ) <> "" Тогда
			ДокументПЛ = ЗаправкиПриИзмененииНаСервере(Элемент.ТекущиеДанные.НомерПЛ,Элемент.ТекущиеДанные.ДатаЗаправки);
			
			Если ДокументПЛ.Пустая() Тогда
				Возврат;
			КонецЕсли;	
			ТекСтрокаЗаправки = ЭтаФорма.Элементы.Заправки.ТекущиеДанные;
			ТекСтрокаЗаправки.НомерПЛ = ПолучитьНомер(ДокументПЛ);
			ТекСтрокаЗаправки.ТС = ПолучитьТС(ДокументПЛ);
			
			Если уатОбщегоНазначения.уатЗначениеНеЗаполнено(ТекСтрокаЗаправки.ПЛ) ИЛИ ТекСтрокаЗаправки.ПЛ.ТранспортноеСредство <> ПолучитьТС(ДокументПЛ) Тогда
				мДатаНачала = ДобавитьМесяц(Объект.Дата, -1);
				
				Док = уатПутевыеЛисты(ПолучитьТС(ДокументПЛ), мДатаНачала, КонецДня(ТекСтрокаЗаправки.ДатаЗаправки),ПолучитьНомер(ДокументПЛ), );
				
				Если НЕ Док.Пустая() Тогда
					ТекСтрокаЗаправки.ПЛ = Док;
				Иначе
					
				КонецЕсли;	
			КонецЕсли;
			
			
			ТекСтрокаЗаправки.ПЛ = ДокументПЛ;
			
			КолВоЛПоПутевому = ПолучитьКолВоПоПутевому(ДокументПЛ,Элемент.ТекущиеДанные.ДатаЗаправки);
			
			ТекСтрокаЗаправки.КоличествоПЛ = КолВоЛПоПутевому; 
		ИначеЕсли Элемент.ТекущиеДанные.ДатаЗаправки <> дАТА(1,1,1) и НЕ Элемент.ТекущиеДанные.ТС.Пустая() Тогда
			
			ДокументПЛ = ЗаправкиПриИзмененииНаСервере1(Элемент.ТекущиеДанные.ТС,Элемент.ТекущиеДанные.ДатаЗаправки);
			
			Если ДокументПЛ.Пустая() Тогда
				Возврат;
			КонецЕсли;	
			ТекСтрокаЗаправки = ЭтаФорма.Элементы.Заправки.ТекущиеДанные;
			ТекСтрокаЗаправки.НомерПЛ = ПолучитьНомер(ДокументПЛ);
			
			Если уатОбщегоНазначения.уатЗначениеНеЗаполнено(ТекСтрокаЗаправки.ПЛ) ИЛИ ТекСтрокаЗаправки.ПЛ.ТранспортноеСредство <> ПолучитьТС(ДокументПЛ) Тогда
				мДатаНачала = ДобавитьМесяц(Объект.Дата, -1);
				
				Док = уатПутевыеЛисты(ПолучитьТС(ДокументПЛ), мДатаНачала, КонецДня(ТекСтрокаЗаправки.ДатаЗаправки),ПолучитьНомер(ДокументПЛ), );
				
				Если НЕ Док.Пустая() Тогда
					ТекСтрокаЗаправки.ПЛ = Док;
				Иначе
					
				КонецЕсли;
			КонецЕсли;
			
			
			ТекСтрокаЗаправки.ПЛ = ДокументПЛ;
			
			КолВоЛПоПутевому = ПолучитьКолВоПоПутевому(ДокументПЛ,Элемент.ТекущиеДанные.ДатаЗаправки);
			
			ТекСтрокаЗаправки.КоличествоПЛ = КолВоЛПоПутевому; 
		КонецЕсли;	
		
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗаправкиДляПЛ(ПЛСсылка)
	тблЗаправки = уатОбщегоНазначения.уатПолучитьЗаправкиДляПЛ(ПЛСсылка);
	мсвЗаправок = уатОбщегоНазначенияСервер.ПреобразоватьТаблицуВМассивСтрок(тблЗаправки);
	Возврат мсвЗаправок;
КонецФункции

&НаСервере
Процедура СоздатьЗаправкиВПутевыхЛистахНаСервере()
	
	Отказ1 = ЛОЖЬ;
	Для Каждого Строка из Объект.Заправки Цикл
		Если НЕ Строка.ПЛ.Пустая() Тогда
			Если НачалоМесяца(Строка.ПЛ.Дата)<>НачалоМесяца(Объект.Дата) Тогда
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "В строке " + Строка.НомерСтроки + " ошибка. Путевой лист другого периода.";
				Сообщение.Сообщить();
				Отказ1 = Истина;
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
	Если НЕ Отказ1 Тогда
		
		Для каждого СтрокаДок из Объект.Заправки Цикл
			Если НЕ СтрокаДок.ПЛ.Пустая() Тогда
				мсвЗаправок = ПолучитьЗаправкиДляПЛ(СтрокаДок.ПЛ);
				Если мсвЗаправок.Количество() = 0 Тогда
					
					ДокОбъект = Документы.уатЗаправкаГСМ.СоздатьДокумент();
					
					ДокОбъект.ПризнакРедактированияИзПутевогоЛиста = Истина;
					ДокОбъект.ПризнакРедактированияИзПутевогоЛистаСсылка = СтрокаДок.ПЛ;
					ДокОбъект.Заполнить(СтрокаДок.ПЛ);
					
					ДокОбъект.ВидДвиженияГСМ = Перечисления.уатВидыДвиженияГСМ.ЗаправкаСклад;
					ДокОбъект.АЗС = Объект.АЗС;
					
					Для каждого СтрокаЗаправки из ДокОбъект.Заправки Цикл
						СтрокаЗаправки.ГСМ = Объект.ГСМ;
						СтрокаЗаправки.Количество = СтрокаДок.Количество;
						СтрокаЗаправки.КоличествоПЛ = СтрокаДок.Количество;
						СтрокаЗаправки.НомерПЛ = СтрокаДок.ПЛ.Номер;
						СтрокаЗаправки.ПутевойЛист = СтрокаДок.ПЛ;
					КонецЦикла;	
					
					Попытка
						ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
						СтрокаДок.КоличествоПЛ = СтрокаДок.Количество;
					Исключение
					КонецПопытки;
					
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеКолонкиКг()
	ИтогПоКг = 0;
	Для Каждого Стр Из Объект.Заправки Цикл
		Стр.Кг = Стр.Количество * стр.Плотность;
		ИтогПоКг = ИтогПоКг + Стр.Кг;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура АЗСПриИзмененииНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	уатПутевойЛист.Водитель1 КАК Водитель
	|ИЗ
	|	Документ.уатПутевойЛист КАК уатПутевойЛист
	|ГДЕ
	|	уатПутевойЛист.ТранспортноеСредство = &ТранспортноеСредство
	|	И НАЧАЛОПЕРИОДА(уатПутевойЛист.Дата, ДЕНЬ) = &Дата";
	
	Запрос.УстановитьПараметр("Дата", НачалоДня(Объект.Дата));
	Запрос.УстановитьПараметр("ТранспортноеСредство", Объект.АЗС.Контрагент_Склад.GDS_ТС);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Объект.МОЛ = ВыборкаДетальныеЗаписи.Водитель;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеИзАвтографНаСервере()
	
	ТаблицаЗаправок = GDS_ФункцииВзаимодействияСАвтограф.ПолучитьДанныеСПистолета(Объект.АЗС, Объект.Дата);
	Если ТаблицаЗаправок = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаID = GDS_ФункцииВзаимодействияСАвтограф.ПолучитьIDДляЗаправки();
	Для Каждого Строка Из Объект.Заправки Цикл
		Строка.КоличествоИзАвтограф = GDS_ФункцииВзаимодействияСАвтограф.ПолучитьЗаправкуДляТС(ТаблицаЗаправок, Строка.ТС, ТаблицаID);	
		IDs = GDS_ФункцииВзаимодействияСАвтограф.ПолучитьIDТерминалаТС(Строка.ТС);
		Если IDs.Количество() <> 0 Тогда
			IdТерминала = IDs[0];
			IdСхемы = IDs[1];
			Строка.КоличествоЗаправленоИзАвтограф = GDS_ФункцииВзаимодействияСАвтограф.ПолучитьОбъемПоступленияТоплива(IdТерминала, IdСхемы, Объект.Дата);
		Иначе
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Для ТС: %1, не существует терминала в ""Автограф""", Строка.ТС.ГосударственныйНомер);
			Сообщение.Сообщить();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
